База_УНФ_для_ЕДТ.КамалаБанк/src/InformationRegisters/КБ_КлючевыеСловаОбъектов/КБ_КлючевыеСловаОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КБ_КлючевыеСловаОбъектов</name>
  <dimensions>
    <name>КлючевоеСлово</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийПоступлениеНаСчет</types>
      <types>EnumRef.ВидыОперацийРасходСоСчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторОбъекта</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗначениеАналитики</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

База_УНФ_для_ЕДТ.КамалаБанк/src/InformationRegisters/КБ_КлючевыеСловаОбъектов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс

// Возвращает массив объектов указанного типа, которым соответствует указанный в параметрах текст 
//
//Параметры:
//	Текст - Строка - Текст, в котором нужно найти ключевые слова
//	ТипСсылки - ОписаниеТипов - тип искомого объекта
//
// Возвращаемое значение: массив
Функция СписокОбъектовПоКлючевомуСлову(Знач Текст) Экспорт

	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("КлючевоеСлово", Текст);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КБ_КлючевыеСловаОбъектов.ВидОперации КАК ВидОперации,
	|	КБ_КлючевыеСловаОбъектов.ИдентификаторОбъекта КАК ИдентификаторОбъекта,
	|	КБ_КлючевыеСловаОбъектов.ЗначениеАналитики КАК Значение,
	|	КБ_КлючевыеСловаОбъектов.КлючевоеСлово КАК КлючевоеСлово,
	|	ПРЕДСТАВЛЕНИЕ(КБ_КлючевыеСловаОбъектов.ЗначениеАналитики) КАК Представление
	|ИЗ
	|	РегистрСведений.КБ_КлючевыеСловаОбъектов КАК КБ_КлючевыеСловаОбъектов
	|ГДЕ
	|	&КлючевоеСлово ПОДОБНО КБ_КлючевыеСловаОбъектов.КлючевоеСлово";

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Устанавливает соответствие между текстом (ключевым словом) и ссылкой на объект учета.
//Каждому тексту может соответствовать только один объект указанного типа
//
//Параметры:
//	Текст - ключевое слово, которое соответствует объекту
//	СсылкаНаОбъект - объект учета
//
Процедура ЗаписатьКлючевоеСловоОбъекта(Знач Текст, ВидОперации = Неопределено, СсылкаНаОбъект = Неопределено) Экспорт

	Если ПустаяСтрока(Текст) Тогда
		Возврат;
	КонецЕсли;

	НаборЗаписей = РегистрыСведений.КБ_КлючевыеСловаОбъектов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.КлючевоеСлово.Установить(Текст);

	Если СсылкаНаОбъект <> Неопределено Тогда
		ИдентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(СсылкаНаОбъект));
	Иначе
		ИдентификаторОбъекта = Справочники.ИдентификаторыОбъектовМетаданных.ПустаяСсылка();
	КонецЕсли;
	НаборЗаписей.Отбор.ИдентификаторОбъекта.Установить(ИдентификаторОбъекта);

	ЗаписьРегистра = НаборЗаписей.Добавить();
	ЗаписьРегистра.КлючевоеСлово = Текст;
	Если СсылкаНаОбъект <> Неопределено Тогда
		ЗаписьРегистра.ИдентификаторОбъекта    = ИдентификаторОбъекта;
		ЗаписьРегистра.ЗначениеАналитики    = СсылкаНаОбъект;
	Иначе
		ЗаписьРегистра.ВидОперации = ВидОперации;
	КонецЕсли;

	НаборЗаписей.Записать(Истина);

КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытий
#КонецОбласти

#КонецЕсли
